package com.wanghengtong.framework.enums;

import lombok.Getter;

/**
 * @author wanghengtong
 * @desc 状态码枚举
 * @date 2024年12月25日 21:15
 */
@Getter
public enum HttpCodeEnum {

    //==================== 登录相关枚举 ======================
    /**
     * 登陆超时
     */
    RC100(100, "登陆超时!"),

    /**
     * 用户未登录
     */
    RC101(101, "用户未登录，请先进行登录!"),

    /**
     * 账户被禁用，请联系管理员解决
     */
    RC102(102, "账户被禁用，请联系管理员解决!"),

    /**
     * 用户信息加载失败
     */
    RC103(103, "用户信息加载失败!"),

    /**
     * 用户身份信息获取失败
     */
    RC104(104, "用户身份信息获取失败!"),

    /**
     * 用户名不能为空
     */
    RC105(105, "用户名不能为空!"),

    /**
     * 密码不能为空
     */
    RC106(106, "密码不能为空!"),

    /**
     * 用户名或密码错误
     */
    RC107(107, "用户名或密码错误!"),

    /**
     * 用户登录成功
     */
    RC108(108, "用户登录成功!"),

    /**
     * 用户注销成功
     */
    RC109(109, "用户注销成功!"),

    //==================== 注册相关枚举 ======================

    /**
     * 验证码错误
     */
    RC300(300, "验证码错误!"),

    /**
     * 验证码过期
     */
    RC301(301, "验证码已过期!"),

    /**
     * 用户名已存在
     */
    RC302(302, "用户名已存在!"),

    //======================= 其他枚举 ==============================

    /**
     * 参数格式不合法
     */
    RC400(400, "参数格式不合法，请检查后重试!"),

    /**
     * 没有权限
     */
    RC403(403, "您没有操作权限!"),

    /**
     * 页面不存在
     */
    RC404(404, "未找到您请求的资源!"),

    /**
     * 请求方式错误
     */
    RC405(405, "请求方式错误，请检查后重试!"),

    /**
     * 超过最大上传大小
     */
    RC413(413, "超过最大上传大小!"),

    /**
     * 操作成功
     */
    SUCCESS(200, "操作成功!"),

    /**
     * 操作失败
     */
    ERROR(500, "操作失败!"),

    /**
     * 未知异常
     */
    RC600(600, "服务器繁忙或服务器错误，请稍后再试!");


    // 响应状态码
    private final Integer code;

    // 响应返回信息
    private final String message;

    HttpCodeEnum(Integer code, String message) {
        this.code = code;
        this.message = message;
    }

}
